<?php if(!defined('__GRFORUM__')) exit(); ?>

<h3>GR Forum v0.94 beta 관리화면에 오신 것을 환영합니다!</h3>
GR Forum 은 GR Board 와 연동되어 동작하는 포럼 도구입니다.<br />
여타의 GR Series 처럼 작고, 가볍고, 빠른 동작을 목표로 만들어졌습니다.<br />
<br />

<h3>관리화면 메뉴 요약 설명입니다.</h3>
<strong>1) 일반 설정</strong>
<ul>
	<li>로고 설정: 포럼 첫 화면 상단에 보여질 포럼의 로고 이미지를 설정합니다.</li>
	<li>포럼 명칭/설명: 포럼의 명칭과 설명을 작성합니다. 로고와 함께 보여집니다.</li>
	<li>스킨 선택: 포럼 사이트의 전체적인 디자인을 선택합니다.</li>
	<li>업데이트: GR Forum 을 업데이트 하신 경우 한 번씩 눌러주는 부분입니다.</li>
	<li>GR Forum 삭제: 필요 없을시 GR Forum 을 삭제합니다.</li>
</ul>
<strong>2) 포럼 관리</strong>
<ul>
	<li>분류 관리: 포럼 내에 주제별로 다단 깊이의 분류를 설정할 수 있습니다.</li>
	<li>차단할 아이디: 특정 사용자의 접근을 차단할 수 있습니다.</li>
	<li>차단할 아이피: 포럼에 접속할 수 없도록 특정 IP 를 지정하실 수 있습니다.</li>
	<li>접근 허용/배제: 비공개로 된 포럼 분류에 어떤 사용자 그룹이 접근할 지 결정합니다.</li>
</ul>
<strong>3) 연동 도구</strong>
<ul>
	<li>GR Board 관리화면: GR Forum 내 대부분의 기능을 관장하는 GR Board 의 관리화면으로 갑니다.</li>
	<li>GR Counter 관리화면: GR Counter 관리화면에 접속하여 접속자 통계 등을 살펴봅니다. (연동 시)</li>
</ul>

<h3>어떤 식으로 동작하나요?</h3>
GR Forum 은 독자적으로 설치되어 동작하는 도구가 아닙니다.<br />
이미 설치하실 때 알고 계셨겠지만, GR Board 와 GR Core 가 미리 설치되어 있어야 합니다.<br />
<br />
포럼 기능의 대부분을 차지하는 회원(멤버)관리, 게시판 설정 등은 모두 GR Board 가 담당하고<br />
나머지 포럼 전체 레이아웃이나 로고, 접근 제한, 분류 설정 등 이처럼 포럼 형태로 '보여지는'<br />
부분들만 GR Forum 이 담당하고 있습니다.<br />
<br />
때문에 포럼 사이트 개설 전에 반드시 GR Board 를 먼저 설치하셔야 하며<br />
GR Forum 다운로드시 동봉된 『GR Forum 전용 GR Board 스킨』을 별도로 GR Board 폴더 내 theme 폴더 안에<br />
FTP 로 업로드 하셔야 합니다.<br />
<br />
이와 같은 동작 방식은 이미 GR Shop 에서 사용된 적이 있으며 이런 방식으로 동작함으로서<br />
개별적인 도구들의 업데이트와 관리가 쉬워지며, 기존에 사용중인 도구의 사용성을 헤치지 않고<br />
각각 그대로 계승할 수 있기 때문에 차후에는 직관적인 관리가 가능해 집니다.<br />
또한 시스템적으로 보았을 때에도 효율성과 안정성을 추구할 수 있는 방식입니다.<br />
<br />

<h3>사용하시면서 궁금하신 점이나 버그를 발견하셨나요?</h3>
설치와 관리부분에서 개별적인 관리 화면들을 만나게 되시면서 기존에 GR Board 를 잘 쓰시던 분들은<br />
별 어려움 없이 적응하실 수 있으나, 이번에 처음 GR Board 와 GR Core, GR Forum 을 만나셨다면<br />
궁금하신 점이 많으실 겁니다. 혹은, 사용하시면서 버그를 발견하실 수 도 있으실 겁니다.<br />
이 때에는 주저 마시고 관리화면 우측 상단의 "<a href="http://sirini.net">시리니넷</a>" 을 클릭하셔서<br />
"<a href="http://sirini.net/grboard/board.php?id=qna">묻고 답하기</a>" 게시판에 글 남겨주시길 바랍니다!<br />
<br />
<br />
<strong>사용해 주셔서 감사드립니다!</strong>